temp1/src/Enums/НастройкиУведомлений/НастройкиУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиУведомлений</name>
  <enumValues>
    <name>ВыполнениеЗадачПоПочте</name>
  </enumValues>
  <enumValues>
    <name>Подписка</name>
  </enumValues>
  <enumValues>
    <name>СрокУведомления</name>
  </enumValues>
  <enumValues>
    <name>ПроцентноеИзменение</name>
  </enumValues>
  <enumValues>
    <name>ЧастотаУведомления</name>
  </enumValues>
</mdclass:Enum>

temp1/src/Enums/СпособыУведомления/СпособыУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУведомления</name>
  <enumValues>
    <name>ПоПочте</name>
  </enumValues>
  <enumValues>
    <name>ПоPush</name>
  </enumValues>
  <enumValues>
    <name>ПоSMS</name>
  </enumValues>
  <enumValues>
    <name>Окном</name>
  </enumValues>
</mdclass:Enum>

temp1/src/Enums/СобытияУведомлений/СобытияУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияУведомлений</name>
  <enumValues>
    <name>ВыполнениеМоейЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ПеренаправлениеМоейЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ПодошелСрокЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ПросроченаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПросроченаЗадачаАвтора</name>
  </enumValues>
  <enumValues>
    <name>СозданиеЗаписиКалендаря</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПрограммы</name>
  </enumValues>
</mdclass:Enum>

temp1/src/Catalogs/ВидыБизнесСобытий/ВидыБизнесСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыБизнесСобытий</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВыполнениеЗадачи</name>
      <description>Выполнение задачи</description>
    </items>
    <items>
      <name>ЗахватФайлаДляРедактирования</name>
      <description>Захват файла для редактирования</description>
    </items>
    <items>
      <name>ИзменениеЗадачи</name>
      <description>Изменение задачи</description>
    </items>
    <items>
      <name>ИзменениеПроекта</name>
      <description>Изменение проекта</description>
    </items>
    <items>
      <name>ИзменениеФайла</name>
      <description>Изменение файла</description>
    </items>
    <items>
      <name>НазначениеОтветственного</name>
      <description>Назначение ответственным за документ</description>
    </items>
    <items>
      <name>ОсвобождениеФайла</name>
      <description>Освобождение файла</description>
    </items>
    <items>
      <name>ОтменаВыполненияЗадачи</name>
      <description>Отмена выполнения задачи</description>
    </items>
    <items>
      <name>ПеренаправлениеЗадачи</name>
      <description>Перенаправление задачи</description>
    </items>
    <items>
      <name>ПолучениеВходящегоПисьма</name>
      <description>Получение входящего письма</description>
    </items>
    <items>
      <name>СозданиеЗадачи</name>
      <description>Создание задачи</description>
    </items>
    <items>
      <name>СозданиеЗаказчика</name>
      <description>Создание заказчика</description>
    </items>
    <items>
      <name>СозданиеПроекта</name>
      <description>Создание проекта</description>
    </items>
    <items>
      <name>СозданиеСообщения</name>
      <description>Создание сообщения</description>
    </items>
    <items>
      <name>СозданиеФайла</name>
      <description>Создание файла</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

temp1/src/Enums/НастройкиУведомлений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает вид события по настройке уведомления.
//
// Параметры:
//  Настройка - ПеречислениеСсылка.НастройкиУведомлений - Настройка.
//
// Возвращаемое значение:
//  СправочникСсылка.ВидыБизнесСобытий, ПеречислениеСсылка.СобытияУведомлений - Вид события.
//
Функция ВидСобытия(Настройка) Экспорт
	
	ВидСобытия = Неопределено;
	Если Настройка = ВыполнениеЗадачПоПочте Тогда
		ВидСобытия = Справочники.ВидыБизнесСобытий.СозданиеЗадачи;
	ИначеЕсли Настройка = ПроцентноеИзменение Тогда
		ВидСобытия = Справочники.ВидыБизнесСобытий.ИзменениеЗначенияПоказателяПроцесса;
	КонецЕсли;
	
	Возврат ВидСобытия;
	
КонецФункции

// Формирует массив связанных подписок.
//
// Параметры:
//  ВидСобытия - СправочникСсылка.ВидыБизнесСобытий, ПеречислениеСсылка.СобытияУведомлений - Вид события.
//
// Возвращаемое значение:
//  Массив - Связанные подписки.
//
Функция СвязанныеПодписки(ВидСобытия) Экспорт
	
	СвязанныеПодписки = Новый Массив;
	Если ВидСобытия = Справочники.ВидыБизнесСобытий.СозданиеЗадачи Тогда
		СвязанныеПодписки.Добавить(Справочники.ВидыБизнесСобытий.ПеренаправлениеЗадачи);
	КонецЕсли;
	
	Возврат СвязанныеПодписки;
	
КонецФункции

// Формирует стандартное значение настройки.
//
// Параметры:
//  Настройка - ПеречислениеСсылка.НастройкиУведомлений - Настройка.
//  ВидСобытия - СправочникСсылка.ВидыБизнесСобытий, ПеречислениеСсылка.СобытияУведомлений - Вид события.
//  СпособУведомления - ПеречислениеСсылка.СпособыУведомления - Способ уведомления.
//
// Возвращаемое значение:
//  Булево, Строка, Число - Значение настройки.
//
Функция СтандартноеЗначениеНастройки(Настройка, ВидСобытия, СпособУведомления) Экспорт
	
	Значение = Неопределено;
	
	Если Настройка = Подписка Тогда
		
		Если СпособУведомления = Перечисления.СпособыУведомления.ПоПочте Тогда
			
			Если ВидСобытия = Справочники.ВидыБизнесСобытий.СозданиеЗадачи
				Или ВидСобытия = Справочники.ВидыБизнесСобытий.ПеренаправлениеЗадачи
				Или ВидСобытия = Справочники.ВидыБизнесСобытий.ОтменаВыполненияЗадачи
				Или ВидСобытия = Справочники.ВидыБизнесСобытий.НазначениеОтветственного
				Или ВидСобытия = Перечисления.СобытияУведомлений.ПодошелСрокЗадачи
				Или ВидСобытия = Перечисления.СобытияУведомлений.ПросроченаЗадача
				Или ВидСобытия = Перечисления.СобытияУведомлений.ПросроченаЗадачаАвтора
				Или ВидСобытия = Справочники.ВидыБизнесСобытий.СозданиеСообщения
				Или ВидСобытия = Перечисления.СобытияУведомлений.УведомлениеПрограммы
				Или ВидСобытия = Перечисления.СобытияУведомлений.ВыполнениеМоейЗадачи
				Или ВидСобытия = Перечисления.СобытияУведомлений.ПеренаправлениеМоейЗадачи Тогда
				Значение = Истина;
			Иначе
				Значение = Ложь;
			КонецЕсли;
			
		ИначеЕсли СпособУведомления = Перечисления.СпособыУведомления.Окном Тогда
			
			Если ВидСобытия = Справочники.ВидыБизнесСобытий.СозданиеЗадачи
				Или ВидСобытия = Справочники.ВидыБизнесСобытий.ПеренаправлениеЗадачи
				Или ВидСобытия = Справочники.ВидыБизнесСобытий.ОтменаВыполненияЗадачи
				Или ВидСобытия = Справочники.ВидыБизнесСобытий.НазначениеОтветственного
				Или ВидСобытия = Перечисления.СобытияУведомлений.УведомлениеПрограммы Тогда
				Значение = Истина;
			Иначе
				Значение = Ложь;
			КонецЕсли;
			
		Иначе
			
			Значение = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли Настройка = СрокУведомления Тогда
		
		Если ВидСобытия = Перечисления.СобытияУведомлений.ПодошелСрокЗадачи Тогда
			Значение = 3;
		Иначе
			Значение = 3;
		КонецЕсли;
		
	ИначеЕсли Настройка = ЧастотаУведомления Тогда
		
		Если ВидСобытия = Перечисления.СобытияУведомлений.ПодошелСрокЗадачи Тогда
			Значение = 0;
		ИначеЕсли ВидСобытия = Перечисления.СобытияУведомлений.ПросроченаЗадача Тогда
			Значение = 1;
		Иначе
			Значение = 0;
		КонецЕсли;
		
	ИначеЕсли Настройка = ВыполнениеЗадачПоПочте Тогда
		
		Значение = Ложь;
		
	ИначеЕсли Настройка = ПроцентноеИзменение Тогда
		
		Значение = 5;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
